#เขียนโปรแกรมรับชื่อ-อายุ แล้วแสดงชื่อ-อายุ อายุ<18เป็นเด็ก อายุ=19-45 คนหนุ่ม วัยรุ่น  อายุ>46 คนแก่


def Showprogramname():
    print ('โปรแกรมตรวจความเป็นเด็ก หนุ่ม แก่')

def data():
    name = input ('กรุณาใส่ชื่อ : ')
    age  = int (input('กรุณาใส่อายุ : '))
    return name, age

def check(name,age):
    if age <= 18 :
        print (f'คุณ {name} เป็น เด็ก')
    elif age >=19 and age <=45 :
        print (f'คุณ {name} เป็น คนหนุ่ม')
    else:
        print (f'คุณ {name} เป็น คนแก่')

print("*******************************************")
Showprogramname ()
print("*******************************************")
name ,age =data()
print("*******************************************")
check (name,age)
print("*******************************************")